// Mapping for department display names
export const departmentMapping: Record<string, string> = {
  "ადმინისტრაციის დეპარტამენტი": "ადმინისტრაცია",
  "ადამიანური რესურსების დეპარტამენტი": "რესურსები",
  "ფინანსების დეპარტამენტი": "ფინანსები",
  "გაყიდვები და მარკეტინგის დეპარტამენტი": "გაყიდვები",
  "ლოჯისტიკის დეპარტამენტი": "ლოჯისტიკა",
  "ტექნოლოგიების დეპარტამენტი": "ტექნოლოგია",
  "მედიის დეპარტამენტი": "მედია",
};

// Mapping for department background colors
export const departmentColors: Record<string, string> = {
  "ადმინისტრაციის დეპარტამენტი": "#FF66A8",
  "ადამიანური რესურსების დეპარტამენტი": "#FFD86D",
  "ფინანსების დეპარტამენტი": "#FD9A6A",
  "გაყიდვები და მარკეტინგის დეპარტამენტი": "#A0D468", // Chosen color
  "ლოჯისტიკის დეპარტამენტი": "#89B6FF",
  "ტექნოლოგიების დეპარტამენტი": "#7E57C2", // Chosen color
  "მედიის დეპარტამენტი": "#00BCD4", // Chosen color
};

// Mapping for priority text (and border) colors.
export const priorityColors: Record<string, string> = {
  დაბალი: "#08A508",
  საშუალო: "#FFBE0B",
  მაღალი: "#FA4D4D",
};

// Mapping for department display names
export const departmentMappingDetails: Record<string, string> = {
  "ადმინისტრაციის დეპარტამენტი": "ადმინისტრაციის დეპარტამენტი",
  "ადამიანური რესურსების დეპარტამენტი": "რესურსების დეპარტამენტი",
  "ფინანსების დეპარტამენტი": "ფინანსების დეპარტამენტი",
  "გაყიდვები და მარკეტინგის დეპარტამენტი": "გაყიდვების დეპარტამენტი",
  "ლოჯისტიკის დეპარტამენტი": "ლოჯისტიკის დეპარტამენტი",
  "ტექნოლოგიების დეპარტამენტი": "ტექნოლოგიის დეპარტამენტი",
  "მედიის დეპარტამენტი": "მედიის დეპარტამენტი",
};
